<!-- Это файл blade-шаблона с демонстрационным кодом.
  Если в файле `config\view.php` прописан путь к папке с этим файлом, то шаблон
  будет доступен под именем `sections.topic1`. В противном случае его нужно 
  скопировать в папку шаблонов, чтобы путь к нему был такой:
     `resources\views\sections\topic2.blade.php`.
  
  Также Вы можете создать новый пустой файл консольной командой
     `php artisan make:view sections.topic2` 
   и скопировать в него этот код ↓ ↓ ↓
-->

<div>
    <p> Приветсвуем Вас на странице Секции 2 !!! </p>
</div>
