<!-- Это файл blade-шаблона с демонстрационным кодом.
  Если в файле `config\view.php` прописан путь к папке с этим файлом, то шаблон
  будет доступен под именем `menu1`. В противном случае его нужно скопировать 
  в папку шаблонов, чтобы путь к нему был такой: 
     `resources\views\menu1.blade.php`.
  
  Также Вы можете создать новый пустой файл шаблона консольной командой
     `php artisan make:view menu1` 
   и скопировать в него этот код ↓ ↓ ↓
-->

<div>
    <p> Приветсвуем Вас на странице Menu 1 !!!
</div>

